{
    "address": "Oxford Drive, London, SE1 2FB, UK",
    "price": 3600,
    "property_type": "Apartment",
    "bedrooms": 2,
    "bathrooms": 2,
    "sizesqft": 697.0,
    "latitude": 51.50403,
    "longitude": -0.082657,
    "date_added": "11/01/2023",
    "description": "We offer custom pricing for any duration. Rates may vary upon exact move in and move out dates.The rate for this home starts at £3,600* / mo. Please visit our website and enter your dates of stay to see up-to-date pricing for your specific booking.*Price quoted is: (1) based on moving in the first day the unit becomes available, (2) applicable only if billed upfront; can be higher if billed in multiple payments, (3) exclusive of any taxes or utilities.Show up and start living from day one in London with this stylish two-bedroom Blueground apartment. You’ll love coming home to this thoughtfully furnished, beautifully designed, and fully-equipped Southwark home. (ID #LON113)Designed with you in mindThoughtfully designed with bespoke finishes, modern furnishings, and a fully-equipped kitchen, you’ll enjoy that “I’m home” feeling with this Blueground apartment. Whether you’re lounging in your roomy living room streaming the latest and greatest entertainment on the smart TV or premium wireless speaker, or getting some well-earned rest on the superior quality mattress with luxury linens, you’ll fall in love with everything this Southwark apartment has to offer. Sleeping arrangementsQueen Bed, 63in/160cmDouble Bed, 55in/140cmAmenitiesBuilding amenities unique to this two-bedroom include an on-site:Washing machineArrival and ongoing supportThe entire apartment is yours to enjoy! You’ll either be personally greeted by a Blueground team member or given self check-in instructions.Throughout your stay, you’ll have access to our Client Experience team through the Blueground App. You can schedule additional cleanings, submit maintenance requests, and view our neighborhood recommendations with just a few taps.We’ll share all details upon confirmation of your stay.Ideally LocatedThis furnished apartment is located in Southwark, a bustling Central London neighbourhood. The area is popular with new arrivals to the city thanks to its convenient location and abundance of cultural riches. Southwark is home to legendary landmarks like the Globe Theatre, made famous by William Shakespeare, and the Tate Modern art gallery. There's also the perennially popular Borough Market, where you can find gorgeous organic produce, artisanal meats and cheeses, and stalls selling all sorts of delicious food. Southwark's restaurant scene is also thriving, with a variety of international options as well as cosy British-style pubs. The neighbourhood is served by the Jubilee and Northern lines of the London Underground as well as several bus lines.Other things to noteThis Blueground apartment has flexible lease options, allowing you to book it for a few months, a year, or more.Please keep in mind that this is a walk up building.We take great pride in ensuring every photo displayed is shot in our own apartments with our actual furnishings. That said, we regularly refresh our decor and furniture arrangement, which may differ from what’s pictured.",
    "features": [
        "Double glazed windows",
        "Dishwasher",
        "Washing machine in unit"
    ],
    "link": "https://www.rightmove.co.uk/properties/117601640#/?channel=RES_LET",
    "agent_email": NaN,
    "floorplan": "https://media.rightmove.co.uk/dir/79k/78429/117601640/78429_LON-113_FLP_00_0001.jpeg"
}